In [2]:
import numpy as np
import pandas as pd

In [5]:
from numpy.random import randn, seed
seed(101) #used to see the same random numbers

In [6]:
df = pd.DataFrame(randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X','Y', 'Z'])

In [7]:
DataFrame = df
print(DataFrame)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [9]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [10]:
type (df['W'])

pandas.core.series.Series

In [11]:
# a dataframe is a bunch of series that shares the same index

In [13]:
type(df)

pandas.core.frame.DataFrame

In [14]:
df.W #recommded not to use

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [16]:
df[['W', 'Z']] #passong a list to retrieve a DataFrame

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [17]:
df['new'] = df['W'] + df['Y']

In [18]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [19]:
df.drop('new', axis=1) #dropping the new column, and axis set to 1 if in case it is 0 it refers to the index
df.drop('A', axis=0) #inplace= True is needed to make sure the changes appear to the dedicated data frame
#df.drop('new', axis=1, inplace=True)
#axis =0 is not compulsory

          W         X         Y         Z       new
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [20]:
df #not deleted to avoid accidental deletion of data

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [21]:
df.shape

(5, 5)

In [22]:
df .loc['A'] #to select a row

W      2.706850
X      0.628133
Y      0.907969
Z      0.503826
new    3.614819
Name: A, dtype: float64

In [23]:
df.loc[['A', 'B']]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959

In [24]:
df.iloc[2]

W     -2.018168
X      0.740122
Y      0.528813
Z     -0.589001
new   -1.489355
Name: C, dtype: float64

In [25]:
df.loc['B', 'Y'] #to select a subset

-0.8480769834036315

In [26]:
df.loc[['A', 'B'], ['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [27]:
df > 0 #conditional statement

       W      X      Y      Z    new
A   True   True   True   True   True
B   True  False  False   True  False
C  False   True   True  False  False
D   True  False  False   True  False
E   True   True   True   True   True

In [28]:
booldf = df>0

In [29]:
df[booldf] #returns the values for which booldf is true

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118       NaN       NaN  0.605965       NaN
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057       NaN
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [30]:
df[df>0]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118       NaN       NaN  0.605965       NaN
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057       NaN
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [33]:
df1=df['W']>0
print(df1)

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [32]:
df[df['W']>0]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [34]:
resultdf= df[df['W']>0]
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [35]:
df[df['W']>0][['X', 'Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [36]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z       new
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [37]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [38]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [39]:
df.reset_index() #here the previous index gets converted into a column
#and the new nuw index in the form of number os placed

  index         W         X         Y         Z       new
0     A  2.706850  0.628133  0.907969  0.503826  3.614819
1     B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
2     C -2.018168  0.740122  0.528813 -0.589001 -1.489355
3     D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
4     E  0.190794  1.978757  2.605967  0.683509  2.796762

In [40]:
newInd="c d t f w".split()

In [41]:
print(newInd)

['c', 'd', 't', 'f', 'w']

In [42]:
df['States'] = newInd

In [43]:
df

          W         X         Y         Z       new States
A  2.706850  0.628133  0.907969  0.503826  3.614819      c
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959      d
C -2.018168  0.740122  0.528813 -0.589001 -1.489355      t
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542      f
E  0.190794  1.978757  2.605967  0.683509  2.796762      w

In [44]:
df.set_index('States')

               W         X         Y         Z       new
States
c       2.706850  0.628133  0.907969  0.503826  3.614819
d       0.651118 -0.319318 -0.848077  0.605965 -0.196959
t      -2.018168  0.740122  0.528813 -0.589001 -1.489355
f       0.188695 -0.758872 -0.933237  0.955057 -0.744542
w       0.190794  1.978757  2.605967  0.683509  2.796762

In [46]:
df

          W         X         Y         Z       new States
A  2.706850  0.628133  0.907969  0.503826  3.614819      c
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959      d
C -2.018168  0.740122  0.528813 -0.589001 -1.489355      t
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542      f
E  0.190794  1.978757  2.605967  0.683509  2.796762      w

In [47]:
outside=['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside= [1,2,3,1,2,3]
hier_index=list(zip(outside, inside))

In [48]:
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [49]:
print(hier_index)

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [50]:
df=pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])

In [51]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [52]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [53]:
df.index.names=['Groups', 'Num']

In [54]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [55]:
df['B']

Groups  Num
G1      1      1.693723
        2     -1.159119
        3      0.390528
G2      1      0.184502
        2      0.072960
        3      0.329646
Name: B, dtype: float64

In [57]:
df['B'].loc['G2'].loc[2]

0.07295967531703869

In [59]:
#to access index values under the same index xs can be implemented
df.xs(1, level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [60]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528